<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>RNNLMによる論文タイトルの自動生成 | 一生あとで読んでろ</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="本稿は慶應義塾大学SFC村井&amp;amp;徳田研 Advent Calendar 2015の19日目である．
TL;DR:　村井研・徳田研の卒論・修論・博論アーカイブから過去の論文タイトルを収集し，RNNLM（Reccurent Neural Network Language Model, 再帰型ニューラルネット言語モデル）[1]を用いて論文タイトルを自動生成する．
手順
論文アーカイブを雑にスクレイ">
<meta property="og:type" content="article">
<meta property="og:title" content="RNNLMによる論文タイトルの自動生成">
<meta property="og:url" content="http://ntddk.github.io/2015/12/19/generating-thesis-titles-with-rnnlm/index.html">
<meta property="og:site_name" content="一生あとで読んでろ">
<meta property="og:description" content="本稿は慶應義塾大学SFC村井&amp;amp;徳田研 Advent Calendar 2015の19日目である．
TL;DR:　村井研・徳田研の卒論・修論・博論アーカイブから過去の論文タイトルを収集し，RNNLM（Reccurent Neural Network Language Model, 再帰型ニューラルネット言語モデル）[1]を用いて論文タイトルを自動生成する．
手順
論文アーカイブを雑にスクレイ">
<meta property="og:image" content="http://ntddk.github.io/image/rnnlm/rnnlm.png">
<meta property="og:image" content="http://ntddk.github.io/image/rnnlm/bptt.png">
<meta property="og:updated_time" content="2016-01-27T04:35:24.362Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="RNNLMによる論文タイトルの自動生成">
<meta name="twitter:description" content="本稿は慶應義塾大学SFC村井&amp;amp;徳田研 Advent Calendar 2015の19日目である．
TL;DR:　村井研・徳田研の卒論・修論・博論アーカイブから過去の論文タイトルを収集し，RNNLM（Reccurent Neural Network Language Model, 再帰型ニューラルネット言語モデル）[1]を用いて論文タイトルを自動生成する．
手順
論文アーカイブを雑にスクレイ">
<meta name="twitter:creator" content="@ntddk">
  
    <link rel="alternative" href="/atom.xml" title="一生あとで読んでろ" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  <link href="//fonts.googleapis.com/css?family=Ubuntu" rel="stylesheet" type="text/css">
  <link rel="stylesheet" href="/css/style.css" type="text/css">
  
</head>
<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">一生あとで読んでろ</a>
      </h1>
      
        <h2 id="subtitle-wrap">
          <a href="/" id="subtitle">技術ブログ</a>
        </h2>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="sub-nav">
        
          <a id="nav-home-icon" class="nav-icon" href="/"></a>
        
          <a id="nav-about-icon" class="nav-icon" href="/about"></a>
        
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
      </nav>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-generating-thesis-titles-with-rnnlm" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      RNNLMによる論文タイトルの自動生成
    </h1>
  

      </header>
    
    <time class="article-date" datetime="2015-12-19T14:45:00.000Z" itemprop="datePublished">12-19-2015</time>
    
  </div>
  <div class="article-inner">
    <div class="article-entry" itemprop="articleBody">
      
        <p>　本稿は<a href="http://www.adventar.org/calendars/1053" target="_blank" rel="external">慶應義塾大学SFC村井&amp;徳田研 Advent Calendar 2015</a>の19日目である．</p>
<h1 id="TL;DR:">TL;DR:</h1><p>　村井研・徳田研の卒論・修論・博論アーカイブから過去の論文タイトルを収集し，RNNLM（Reccurent Neural Network Language Model, 再帰型ニューラルネット言語モデル）[1]を用いて論文タイトルを自動生成する．</p>
<h1 id="手順">手順</h1><ol>
<li><a href="http://www.sfc.wide.ad.jp/paper.html" target="_blank" rel="external">論文アーカイブ</a>を雑にスクレイピング．</li>
<li>簡単のため英語タイトルを削る．データサイズは540行・16294字．</li>
<li>MeCabの<code>-Owakati</code>オプションで分かち書き．単語数は6272と少ない．</li>
<li>RNNLMで学習，出力．</li>
</ol>
<p>　生成した論文タイトルは次の通り．</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">&#25913;&#22793;&#36969;&#24540;&#27231;&#29872;&#22659;&#12395;&#12362;&#12369;&#12427;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#21270;&#12398;&#35373;&#35336;&#12392;&#23455;&#35013;&#10;&#26286;&#12425;&#12375;&#35336;&#31639;&#30330;&#35211;&#12434;&#21033;&#29992;&#12375;&#12383;UDL&#27231;&#22120;&#10;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12434;&#29992;&#12356;&#12383;&#27231;&#22120;&#12503;&#12525;&#12540;&#12502;&#20307;&#31995;&#12398;VoD&#12395;&#12388;&#12356;&#12390;&#38283;&#30330;&#12394;&#25915;&#25731;&#36939;&#29992;&#25163;&#27861;&#10;&#33258;&#24459;&#35336;&#31639;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12398;&#34892;&#21205;&#12395;-&#31227;&#21205;&#12471;&#12473;&#12486;&#12512;&#12395;&#38306;&#12377;&#12427;&#30740;&#31350;&#10;&#34907;&#26143;&#24773;&#22577;&#12434;&#29992;&#12356;&#12383;&#12499;&#12472;&#12517;&#12450;&#12521;&#12452;&#12476;&#12540;&#12471;&#12519;&#12531;&#23450;&#32681;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#34920;&#12434;&#12377;&#12427;&#26908;&#20986;&#12518;&#12499;&#12461;&#12479;&#12473;&#12494;&#12540;&#12489;&#12398;&#12501;&#12449;&#12452;&#12523;&#27083;&#25104;&#12395;&#38306;&#12377;&#12427;&#30740;&#31350;&#10;&#12354;&#12375;&#12354;&#12392;&#36969;&#24540;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12434;&#29992;&#12356;&#12383;&#36000;&#33655;&#35696;&#20107;&#21462;&#12426;&#20837;&#12428;&#12383;&#12475;&#12531;&#12469;NEMOMANET&#35299;&#27770;&#10;&#12518;&#12540;&#12470;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12395;&#36969;&#12375;&#12383;&#20206;&#24819;&#12394;&#36890;&#20449;&#25509;&#36817;&#12395;&#12424;&#12427;&#21046;&#24481;&#23550;&#35937;&#12398;&#35373;&#35336;&#12392;&#23455;&#35013;&#10;&#33988;&#31309;&#23398;&#26657;&#21033;&#29992;&#24615;&#12398;&#12383;&#12417;&#12398;&#20877;&#20316;&#26989;&#12395;&#38306;&#12377;&#12427;&#25345;&#32154;&#10;&#22411;&#36899;&#25658;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12398;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12395;&#22522;&#12389;&#12367;&#36960;&#38548;&#12467;&#12540;&#12489;&#12398;&#21521;&#12369;&#12383;&#12487;&#12472;&#12479;&#12523;&#27231;&#27083;&#12398;&#27083;&#31689;&#10;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#65306;&#22411;&#12392;&#26178;&#38291;&#29305;&#23450;&#12434;&#29992;&#12356;&#12383;&#21033;&#29992;&#22411;&#36335;&#28310;&#25312;&#30456;&#38306;&#12398;&#27083;&#31689;&#10;&#33258;&#24459;&#38651;&#35441;&#25945;&#32946;&#12395;&#12362;&#12369;&#12427;&#30064;&#31278;&#21697;&#36074;&#31354;&#38291;&#25903;&#25588;&#12471;&#12473;&#12486;&#12512;&#12398;&#35373;&#35336;&#12392;&#23455;&#35013;&#10;&#20301;&#32622;AV&#31471;&#26411;&#33879;&#20316;&#25480;&#26989;&#29305;&#27530;&#12488;&#12509;&#12525;&#12472;&#22411;&#12375;&#20998;&#26512;&#39640;&#36895;&#27083;&#31689;&#10;&#24195;&#22495;&#12434;&#21033;&#29992;&#12375;&#12383;&#27425;&#24540;&#29992;&#12395;&#12362;&#12369;&#12427;&#12524;&#12452;&#12516;&#12540;&#12394;&#25480;&#26989;&#12395;&#38306;&#12377;&#12427;&#30740;&#31350;&#12503;&#12525;&#12471;&#12473;&#12486;&#12512;&#12395;&#38306;&#12377;&#12427;&#30740;&#31350;&#10;&#27425;&#21046;&#24481;&#23550;&#12377;&#12427;&#12459;&#12513;&#12521;&#12434;&#21033;&#29992;&#12375;&#12383;Ad&#22411;&#38291;&#23627;&#22806;&#12497;&#12502;&#12522;&#12483;&#12463;&#27083;&#31689;&#10;&#21332;&#35519;:&#19981;s&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12395;&#12362;&#12369;&#12427;OS&#12473;&#12488;&#12522;&#12540;&#12511;&#12531;&#12464;&#12398;&#32771;&#24942;&#27231;&#22120;&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#37197;&#20449;&#12471;&#12473;&#12486;&#12512;&#12398;&#35373;&#35336;&#12392;&#23455;&#35013;&#10;&#12475;&#12531;&#12469;&#29872;&#22659;&#12395;&#12362;&#12369;&#12427;&#12487;&#12496;&#12452;&#12473;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#25991;&#23383;&#36890;&#20449;&#12471;&#12473;&#12486;&#12512;&#10;&#28961;&#32218;&#20316;&#26989;&#12417;&#12368;&#12427;&#12395;&#12362;&#12369;&#12427;&#12497;&#12465;&#12483;&#12488;IP&#30330;&#20449;&#12539;&#25903;&#25588;&#27231;&#27083;&#10;ELA&#19978;&#29872;&#22659;&#12395;&#24540;&#12376;&#12383;&#12375;&#12383;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#28204;&#23450;&#12395;&#38306;&#12377;&#12427;&#30740;&#31350;&#10;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#22411;&#12503;&#12521;&#12483;&#12488;&#12507;&#12540;&#12512;&#12398;&#36960;&#38548;&#12497;&#12465;&#12483;&#12488;&#12392;&#12471;&#12473;&#12486;&#12512;&#10;&#28961;&#32218;&#12467;&#12531;&#12488;&#12525;&#12540;&#12523;&#12475;&#12531;&#12469;&#12434;&#32771;&#24942;&#12377;&#12427;&#21442;&#21152;&#21442;&#21152;&#12469;&#12540;&#12499;&#12473;&#12398;&#30740;&#31350;&#10;&#31227;&#21205;&#32773;&#12395;&#12362;&#12369;&#12427;&#20301;&#32622;&#36969;&#24540;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#25163;&#27861;&#12398;&#30740;&#31350;&#10;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12464;&#12523;&#12540;&#12500;&#12531;&#12464;&#12398;&#22238;&#35239;&#24615;&#12434;&#12471;&#12473;&#12486;&#12512;&#12375;&#12383;&#32076;&#36335;&#28040;&#32791;&#24615;&#12398;&#23455;&#29694;&#10;&#33258;&#24049;&#24773;&#22577;&#12434;&#29992;&#12356;&#12383;&#23455;&#12434;&#37327;&#23376;&#12424;&#12427;&#21332;&#35519;&#34920;&#34892;&#21205;&#27969;&#36890;&#10;&#12487;&#12472;&#12479;&#12523;&#21069;&#36960;&#38548;&#12375;&#12427;&#12375;&#12398;&#24773;&#22577;&#20849;&#26377;&#25903;&#25588;&#27231;&#27083;&#10;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12488;&#21487;&#35222;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12434;&#36554;&#30340;&#22522;&#30436;&#12301;&#38306;&#25968;&#12398;&#20998;&#26512;&#10;&#29872;&#22659;Computing&#36890;&#20449;DVB&#25658;&#24111;&#24615;&#12395;&#38306;&#12377;&#12427;&#31227;&#21205;&#21516;&#26399;&#21033;&#29992;&#12398;&#35373;&#35336;&#12392;&#23455;&#35013;&#10;&#12510;&#12523;&#12481;&#12497;&#12473;Function&#28961;&#32218;&#12475;&#12531;&#12469;&#12494;&#12540;&#12489;&#12434;&#29992;&#12356;&#12383;&#25216;&#34899;&#12510;&#12523;&#12481;&#25903;&#25588;&#25903;&#25588;&#20419;&#36914;&#12395;&#38306;&#12377;&#12427;&#30740;&#31350;&#10;&#12473;&#12510;&#12540;&#12488;&#19990;&#20195;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12395;&#12362;&#12369;&#12427;&#30456;&#20114;&#12502;&#12522;&#12483;&#12472;&#23478;&#38651;&#12471;&#12473;&#12486;&#12512;&#12398;&#35373;&#35336;&#12392;&#23455;&#35013;&#10;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#24773;&#22577;&#12398;&#12383;&#12417;&#12398;&#33288;&#21619;&#28961;&#25903;&#25588;&#12471;&#12473;&#12486;&#12512;&#12398;&#27083;&#31689;&#10;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#22411;IP&#29872;&#22659;&#12398;&#12503;&#12525;&#12501;&#12449;&#12452;&#12522;&#12531;&#12464;&#30340;&#12394;&#20449;&#38972;&#12395;&#38306;&#12377;&#12427;&#30740;&#31350;&#10;&#23455;&#26041;&#21521;&#33258;&#21205;&#12509;&#12525;&#12472;&#12395;&#12362;&#12369;&#12427;&#21516;&#26399;&#27231;&#22120;&#24615;&#12395;&#12362;&#12369;&#12427;&#30740;&#31350;&#10;&#12475;&#12531;&#12469;-&#25277;&#20986;&#29983;&#25104;&#12434;&#25903;&#25588;&#24773;&#22577;&#30331;&#37682;&#25277;&#20986;&#27231;&#27083;&#12398;&#27083;&#31689;&#10;&#12450;&#12489;&#12507;&#12483;&#12463;OS&#12395;&#12362;&#12369;&#12427;OS&#29872;&#22659;&#12398;Glass&#24615;&#22522;&#30436;&#27231;&#27083;&#12398;&#27083;&#31689;&#10;DV&#22320;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#32773;&#12395;&#12424;&#12427;&#26368;&#36969;&#12356;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;&#10;&#21830;&#19978;&#12398;&#12383;&#12417;&#12398;&#36984;&#25246;&#12394;Mobile&#21177;&#29575;&#12471;&#12473;&#12486;&#12512;&#12398;&#27083;&#31689;&#10;&#12518;&#12499;&#12461;&#12479;&#12473;&#19990;&#20195;&#29872;&#22659;&#12395;&#12362;&#12369;&#12427;&#21177;&#29575;Wireless&#24773;&#22577;&#12398;Markit&#10;&#31995;&#21015;&#28436;&#22863;&#20301;&#32622;&#12473;&#12524;&#12483;&#12489;&#12469;&#12540;&#12499;&#12473;&#20108;&#12510;&#12483;&#12481;&#12531;&#12464;&#12510;&#12523;&#12481;&#12503;&#12525;&#12450;&#12463;&#12486;&#12451;&#12502;&#12514;&#12487;&#12523;&#12398;&#27083;&#31689;&#10;&#12497;&#12465;&#12483;&#12488;&#36969;&#24540;&#20184;&#12369;&#21033;&#29992;&#12434;&#32771;&#24942;&#12375;&#12383;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12502;&#12525;&#12464;&#12514;&#12487;&#12523;&#12398;&#35373;&#35336;&#12392;&#23455;&#35013;&#10;TranS&#24773;&#22577;&#29872;&#22659;&#12395;&#12362;&#12369;&#12427;&#12464;&#12523;&#12540;&#12503;&#12507;&#12473;&#12488;&#21516;&#26399;&#12408;&#12398;&#23433;&#20840;&#23653;&#27508;&#12392;&#20998;&#25955;&#10;&#12398;&#24773;&#22577;&#23550;&#35937;&#12391;&#12398;Mediator&#12467;&#12521;&#12508;&#12524;&#12540;&#12471;&#12519;&#12531;&#12395;&#38306;&#12377;&#12427;&#30740;&#31350;&#10;&#39006;&#20284;All&#12471;&#12473;&#12486;&#12512;&#10;&#24773;&#22577;&#12464;&#12523;&#12540;&#12503;&#12434;&#21033;&#29992;&#12377;&#12427;&#12487;&#12472;&#12479;&#12523;&#21046;&#24481;&#21205;&#30011;&#20687;&#37197;&#36865;&#12471;&#12473;&#12486;&#12512;&#12398;&#27083;&#31689;&#10;RFID&#12434;&#21033;&#29992;&#12375;&#12383;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12398;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#36578;&#36865;&#12395;&#38306;&#12377;&#12427;&#30740;&#31350;&#10;&#21608;&#36794;&#19978;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12395;&#12362;&#12369;&#12427;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#32773;&#22522;&#28961;&#32218;&#12398;&#25552;&#26696;&#12395;&#38306;&#12377;&#12427;&#30740;&#31350;&#10;Link&#22411;&#26381;&#34892;&#21205;RCS&#12395;&#12362;&#12369;&#12427;&#21177;&#29575;&#12375;&#12394;&#12356;&#27231;&#27083;&#10;&#12463;&#12521;&#12471;&#12483;&#12463;&#22411;&#36554;&#36617;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12434;&#35299;&#27770;&#12375;&#12383;&#20998;&#25955;&#38899;&#22768;&#12394;&#12426;&#12377;&#12414;&#12375;&#12471;&#12473;&#12486;&#12512;&#10;Dynamic&#29305;&#24500;&#35299;&#26512;&#12395;&#22522;&#12389;&#12367;&#20206;&#24819;&#21046;&#24481;&#27231;&#27083;&#12398;&#35373;&#35336;&#12392;&#23455;&#35013;&#10;&#22810;&#27573;CSMA&#12395;&#12362;&#12369;&#12427;&#22810;&#27096;&#12394;&#35299;&#26512;&#31649;&#29702;&#27231;&#27083;&#12398;&#35373;&#35336;&#12392;&#23455;&#35013;&#10;&#31227;&#21205;&#27231;:&#12434;&#29992;&#12356;&#12383;-&#12467;&#12531;&#12486;&#12531;&#12484;&#12471;&#12473;&#12486;&#12512;&#12398;&#27083;&#31689;&#10;&#25216;&#34899;&#12475;&#12531;&#12469;&#29872;&#22659;&#12395;&#12362;&#12369;&#12427;&#12507;&#12540;&#12512;&#21270;&#12395;&#12424;&#12427;&#32076;&#36335;&#12469;&#12540;&#12496;&#10;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#22238;&#32218;&#12395;&#22522;&#12389;&#12367;&#34214;&#29872;&#22659;&#12395;&#12362;&#12369;&#12427;&#12377;&#12427;&#20316;&#25104;&#12408;&#12398;&#34892;&#21205;&#21033;&#29992;&#12395;&#38306;&#12377;&#12427;&#30740;&#31350;&#10;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12434;&#29992;&#12356;&#12383;&#12375;&#12383;&#12394;&#21205;&#30011;&#12523;&#12540;&#12523;&#12395;&#38306;&#12377;&#12427;&#30740;&#31350;&#10;&#27231;&#22120;&#21332;&#35519;&#21033;&#29992;Efficient&#12398;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#35299;&#27770;&#12398;&#12456;&#12531;&#12489;&#26144;&#20687;&#27083;&#31689;&#10;&#35336;&#31639;&#24773;&#22577;&#12434;&#21033;&#29992;&#12375;&#12383;&#23478;&#38651;&#25277;&#35937;&#12398;&#36855;&#12356;&#36899;&#25658;&#12408;&#12398;&#27083;&#31689;&#10;&#38306;&#36899;&#24773;&#22577;&#25945;&#32946;&#12395;&#12362;&#12369;&#12427;&#21205;&#30340;&#12513;&#12540;&#12523;&#12452;&#12505;&#12531;&#12488;&#21454;&#38598;&#12398;&#30740;&#31350;&#10;&#36890;&#30693;&#12395;&#12362;&#12369;&#12427;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#26041;&#24335;&#36092;&#36023;&#12395;&#12424;&#12427;&#12375;&#12383;&#29366;&#24907;&#26178;&#38291;&#12464;&#12523;&#12540;&#12503;&#12395;&#38306;&#12377;&#12427;&#30740;&#31350;&#10;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;:6&#12398;&#12383;&#12417;&#12398;&#12383;&#12417;&#12398;&#35373;&#35336;&#12392;&#23455;&#35013;&#10;&#38651;&#23376;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12398;&#12383;&#12417;&#12398;&#25552;&#26696;&#12392;&#23455;&#35013;&#10;&#33258;&#24049;&#38651;&#35441;&#12434;&#21033;&#29992;&#12375;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#20998;&#25955;&#22411;&#25480;&#26989;&#23646;&#24615;&#21046;&#24481;&#27231;&#27083;&#12398;&#23455;&#29694;&#10;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12398;&#25277;&#20986;&#21270;&#29872;&#22659;&#12398;&#21521;&#19978;&#22311;&#32302;&#12471;&#12473;&#12486;&#12512;&#12398;&#27083;&#31689;&#10;Networks&#23550;&#25126;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12395;&#12362;&#12369;&#12427;&#23478;&#24237;&#12486;&#12522;&#12488;&#12522;&#12540;&#25163;&#27861;&#12398;&#27083;&#31689;&#10;&#24195;&#12496;&#12452;&#12488;&#20381;&#23384;&#24739;&#32773;&#12398;&#12383;&#12417;&#12398;&#21454;&#38598;&#21450;&#12403;&#31309;&#26997;&#12471;&#12473;&#12486;&#12512;&#10;IP&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#31934;&#24230;&#28857;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#30340;&#12392;-&#30330;&#35211;&#29872;&#22659;&#21205;&#30011;&#20687;&#12514;&#12487;&#12523;&#34892;&#21205;-&#10;&#36890;&#20449;&#20316;&#26989;&#12471;&#12473;&#12486;&#12512;&#12398;&#21547;&#12416;&#23646;&#24615;&#12475;&#12531;&#12469;&#12494;&#12540;&#12489;&#20184;&#12369;&#21487;&#33021;&#12513;&#12487;&#12451;&#12450;&#12398;&#25552;&#26696;&#12392;&#38283;&#30330;&#10;&#24773;&#22577;&#19990;&#20195;&#29872;&#22659;&#26178;&#12395;&#12424;&#12427;&#26368;&#36969;&#35222;&#28857;&#29872;&#22659;&#27231;&#27083;&#12398;&#35373;&#35336;&#12392;&#23455;&#35013;&#10;&#21332;&#35519;&#33988;&#31309;&#12514;&#12496;&#12452;&#12523;&#12496;&#12483;&#12486;&#12522;&#25903;&#25588;Shumu&#27231;&#22120;&#22411;&#35373;&#32622;&#12452;&#12531;&#12471;&#12487;&#12531;&#12488;Irma&#20445;&#35703;&#37327;&#10;&#20998;&#25955;&#22238;&#32218;&#12395;&#12475;&#12531;&#12469;&#12487;&#12540;&#12479;&#36969;&#24540;&#12434;&#12510;&#12483;&#12481;&#12531;&#12464;&#12392;&#22522;&#28310;&#21270;&#12395;&#38306;&#12377;&#12427;&#30740;&#31350;&#10;&#29872;&#22659;&#12373;&#26178;&#35079;&#25968;&#29992;&#26041;&#24335;&#12392;&#23529;&#35696;&#12395;&#38306;&#12377;&#12427;&#30740;&#31350;&#10;&#33258;&#24459;&#12522;&#12531;&#12463;&#29872;&#22659;&#12395;&#12362;&#12369;&#12427;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12539;&#23646;&#24615;&#21697;&#36074;&#10;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12375;&#12395;&#12362;&#12369;&#12427;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#25216;&#27861;&#21270;&#25512;&#34214;&#27231;&#27083;&#12398;&#30740;&#31350;&#10;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12395;&#12362;&#12369;&#12427;&#20809;&#12434;&#29992;&#12356;&#12383;&#26368;&#36969;&#36960;&#38548;&#25903;&#25588;&#29872;&#22659;&#12398;&#27083;&#31689;&#10;&#12514;&#12540;&#12496;&#12452;&#12523;s&#21033;&#29992;&#12392;&#12408;&#12398;&#23455;&#29694;&#33258;&#21205;&#25163;&#27861;&#12398;&#35373;&#35336;&#12392;&#23455;&#35013;&#10;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12395;&#36969;&#12375;&#12383;&#26178;&#31471;&#26411;&#22411;TCP&#22411;&#12487;&#12540;&#12479;&#22522;&#28310;&#12398;&#20869;&#10;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12434;&#29992;&#12356;&#12383;&#21463;&#20449;&#12539;&#36766;&#26360;&#21454;&#38598;&#10;DOS&#30340;&#21033;&#29992;&#29872;&#22659;&#12395;&#12362;&#12369;&#12427;based&#37197;&#20449;&#12471;&#12473;&#12486;&#12512;&#12398;&#27083;&#31689;&#10;i&#65306;&#12392;&#21033;&#29992;&#12375;&#12383;&#24773;&#22577;&#12514;&#12540;&#12480;&#12523;&#12398;&#20316;&#25104;&#12395;&#38306;&#12377;&#12427;&#30740;&#31350;&#10;API&#12398;&#24773;&#22577;&#12395;&#12362;&#12369;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12377;&#12427;&#12434;&#12471;&#12473;&#12486;&#12512;&#12398;&#33258;&#24459;&#10;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12434;&#29992;&#12356;&#12383;&#12475;&#12523;&#20869;&#22238;&#36991;&#25163;&#27861;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;Function&#36984;&#25246;&#21046;&#24481;&#27231;&#27083;&#10;&#12510;&#12523;&#12481;:&#12518;&#12540;&#12470;&#26178;&#12398;Looking&#25903;&#25588;&#31478;&#21512;&#12398;&#21442;&#21152;&#24773;&#22577;&#12395;&#38306;&#12377;&#12427;&#30740;&#31350;&#10;&#12510;&#12523;&#12481;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12395;&#12424;&#12427;&#21205;&#30340;&#12522;&#12514;&#12467;&#12531;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12398;&#20998;&#26512;&#12395;&#38306;&#12377;&#12427;&#30740;&#31350;&#10;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#65306;&#25991;&#23383;&#12434;&#21547;&#12416;&#12392;&#23550;&#31574;&#36605;&#28187;&#22320;&#29702;&#12501;&#12449;&#12452;&#12523;&#12398;&#27083;&#31689;&#10;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12487;&#12472;&#12479;&#12523;&#34892;&#21205;&#29872;&#22659;&#12395;&#12362;&#12369;&#12427;&#36000;&#33655;&#25945;&#32946;&#12398;&#35373;&#35336;&#12392;&#23455;&#35013;&#10;&#31227;&#21205;&#21046;&#24481;&#22411;&#12513;&#12487;&#12451;&#12450;&#21462;&#12426;&#20837;&#12428;&#12383;&#12395;&#12362;&#12369;&#12427;&#33258;&#24459;&#12488;&#12509;&#12525;&#12472;&#12514;&#12487;&#12523;&#12398;&#25552;&#26696;&#10;&#26085;&#26412;&#22238;&#32218;&#26178;&#12395;&#12362;&#12369;&#12427;&#12475;&#12531;&#12469;&#12398;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#10;&#12302;&#19990;&#20195;sion&#12434;&#25903;&#25588;&#24773;&#22577;&#12518;&#12540;&#12470;&#12398;&#23455;&#29694;&#10;Mobile&#12398;&#34892;&#21205;&#31354;&#38291;&#12395;&#22522;&#12389;&#12367;&#12377;&#12427;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12471;&#12473;&#12486;&#12512;&#12398;&#35373;&#35336;&#12392;&#27083;&#31689;&#10;&#12461;&#12483;&#12488;&#12521;&#12452;&#12502;&#12521;&#12522;&#12398;&#12450;&#12489;&#12524;&#12473;&#21033;&#29992;&#12434;&#25903;&#25588;&#12377;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#34892;&#21205;&#12395;&#38306;&#12377;&#12427;&#30740;&#31350;&#10;&#38291;:&#29872;&#22659;&#12395;&#12362;&#12369;&#12427;&#35469;&#35388;&#26908;&#20986;&#12398;&#32771;&#23519;&#10;&#37749;&#30436;&#12434;&#29992;&#12356;&#12383;&#22522;&#30436;&#32076;&#36335;&#12488;&#12509;&#12525;&#12472;&#25903;&#25588;&#25163;&#27861;&#12398;&#30740;&#31350;&#10;RFID&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12434;&#29992;&#12356;&#12383;&#12392;&#12518;&#12540;&#12470;&#10;&#33258;&#24459;&#22411;&#27231;&#30340;&#12394;&#25903;&#25588;&#12524;&#12452;&#12516;&#12540;&#25163;&#27861;&#12398;&#35373;&#35336;&#12392;&#23455;&#35013;&#10;&#12450;&#12489;&#12507;&#12483;&#12463;&#12434;&#29992;&#12356;&#12383;&#12487;&#12472;&#12479;&#12523;&#26368;&#36969;&#26263;&#21495;&#12471;&#12473;&#12486;&#12512;&#12398;&#30740;&#31350;&#10;WWW&#20154;IPv&#12471;&#12473;&#12486;&#12512;&#12398;&#21205;&#30340;2&#12434;&#21270;&#12501;&#12525;&#12540;&#12452;&#12531;&#12501;&#12457;&#12513;&#12540;&#12471;&#12519;&#12531;&#37197;&#36865;&#21270;&#25163;&#27861;&#10;&#27425;&#30340;&#27231;&#12479;&#12501;&#12455;&#12540;&#12473;6&#12471;&#12473;&#12486;&#12512;&#12398;&#23455;&#29694;&#10;IP&#12524;&#12452;&#12516;&#12540;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12395;&#12362;&#12369;&#12427;&#12464;&#12523;&#12540;&#12503;&#21462;&#24471;&#36960;&#38548;&#12471;&#12473;&#12486;&#12512;&#12395;&#38306;&#12377;&#12427;&#30740;&#31350;&#10;&#20108;&#36890;&#20449;&#12518;&#12491;&#12496;&#12540;&#12469;&#12523;&#12395;&#12362;&#12369;&#12427;&#35079;&#25968;&#20849;&#26377;&#20877;&#12395;&#12388;&#12356;&#12390;&#12398;&#30740;&#31350;&#10;Tapirus&#19978;&#12398;&#24773;&#22577;&#30340;&#23455;&#29694;&#12354;&#12427;&#12398;&#27083;&#31689;&#10;&#29872;&#22659;&#19978;&#12395;&#12362;&#12369;&#12427;&#20206;&#24819;&#25351;&#27231;&#27083;&#12398;&#27083;&#31689;&#10;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12395;&#12362;&#12369;&#12427;RFID&#32076;&#36335;&#12456;&#12531;&#12489;&#12494;&#12540;&#12489;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#20184;&#12369;&#12514;&#12487;&#12523;&#12398;&#35373;&#35336;&#12392;&#23455;&#35013;&#10;2&#22238;&#32218;&#23398;&#32722;&#12408;&#12398;&#21177;&#29575;&#30340;&#22411;&#29872;&#22659;&#12398;&#25552;&#26696;&#12392;&#27083;&#31689;&#10;...</span><br></pre></td></tr></table></figure>
<p>　これはRNNLMが生成した論文タイトルを100件無作為抽出したもの．全リストは<a href="https://gist.github.com/ntddk/c1dd4476677667157a97" target="_blank" rel="external">gist</a>に置いている．この程度のデータサイズでRNNLMの性能を云々するのはいささか危うい気がするが，論文タイトルの末尾はえてして「～の構築」「～の研究」「～の実現」になるというルールを獲得できている，ということだろうか．<br>　同じデータセットから，ありがちな2単語プリフィックスのマルコフ連鎖で生成した論文タイトルは次の通り．</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">&#27880;&#30446;&#12375;&#12383;&#20108;&#28857;&#38291;&#25509;&#32154;&#22522;&#30436;&#12477;&#12501;&#12488;&#12454;&#12456;&#12450;&#12398;&#27083;&#31689;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#10;&#22320;&#22495;&#12395;&#12362;&#12369;&#12427;&#39640;&#31561;&#25945;&#32946;&#21332;&#21147;&#25163;&#27861;&#12398;&#30740;&#31350;&#12507;&#12540;&#12512;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12395;&#12362;&#12369;&#12427;&#22810;&#27096;&#10;&#12363;&#12388;&#12473;&#12465;&#12540;&#12521;&#12502;&#12523;&#12394;&#35672;&#21029;&#23376;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#12466;&#12540;&#12512;&#12467;&#12531;&#12477;&#12540;&#12523;&#12395;&#23550;&#24540;&#12377;&#12427;&#31649;&#29702;&#10;&#36939;&#29992;&#22522;&#30436;&#20998;&#26512;&#12395;&#38306;&#12377;&#12427;&#30740;&#31350;&#12509;&#12522;&#12471;&#32076;&#36335;&#21046;&#24481;&#12395;&#38306;&#12377;&#12427;&#30740;&#31350;&#22823;&#10;&#20219;&#24847;&#12398;&#29289;&#29702;&#30340;&#37327;&#23376;&#12499;&#12483;&#12488;&#12395;&#23550;&#12377;&#12427;&#21177;&#29575;&#30340;&#12394;&#24773;&#22577;&#38322;&#35239;&#10;&#33075;&#30130;&#21172;&#26908;&#30693;&#12471;&#12473;&#12486;&#12512;&#12398;&#25552;&#26696;&#27425;&#19990;&#20195;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#32076;&#36335;&#21046;&#24481;&#12434;&#29992;&#12356;&#10;&#37749;&#20132;&#25563;&#27231;&#27083;&#12398;&#23455;&#35013;&#12392;&#35413;&#20385;&#21021;&#31561;&#20013;&#31561;&#25945;&#32946;&#12395;&#12362;&#12369;&#12427;WWW&#10;&#12503;&#12525;&#12475;&#12473;&#12487;&#12470;&#12452;&#12531;&#29255;&#26041;&#21521;&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12513;&#12487;&#12451;&#12450;&#12434;&#29992;&#12356;&#12383;&#12518;&#12499;&#12461;&#12479;&#12473;&#12467;&#12531;&#12500;&#12517;&#12540;&#12486;&#12451;&#12531;&#12464;&#29872;&#22659;&#12395;&#36969;&#12375;&#10;&#36899;&#25658;&#12471;&#12473;&#12486;&#12512;&#12398;&#35373;&#35336;&#12392;&#23455;&#35013;exPhoto:&#21608;&#36794;&#27231;&#22120;&#12392;&#25774;&#24433;&#10;&#12395;&#38306;&#12377;&#12427;&#30740;&#31350;&#20998;&#25955;&#29872;&#22659;&#12395;&#12362;&#12369;&#12427;&#12503;&#12525;&#12450;&#12463;&#12486;&#12451;&#12502;&#21046;&#24481;&#26041;&#24335;&#12395;&#38306;&#12377;&#12427;&#30740;&#31350;&#12450;&#12489;&#12507;&#12483;&#12463;&#10;...</span><br></pre></td></tr></table></figure>
<p>　パッと見でRNNLMが生成した論文タイトルの方がより自然に思える．で，RNNLMって何なの？</p>
<h1 id="RNNLM">RNNLM</h1><p>　読んで字のごとくRNNLMはRNNの言語モデルへの応用である．<br>　RNNは内部に有向閉路をもつニューラルネット．系列データの各時刻<span>$t$</span><!-- Has MathJax -->につき1つの入力<span>$x^t$</span><!-- Has MathJax -->をとり1つの出力<span>$y^t$</span><!-- Has MathJax -->を返す．ふつう順伝播型ニューラルネットは入力1つをとり1つの入力を与える写像を表現するが，RNNは任意の系列—すなわち過去のすべての入力から任意の系列への写像を表現する．<br>　これは<strong>時刻<span>$t-1$</span><!-- Has MathJax -->の隠れ層の出力を，時刻<span>$t$</span><!-- Has MathJax -->の隠れ層の入力に与える</strong>ことで実現される．</p>
<p><img src="/image/rnnlm/rnnlm.png" width="30%" height="30%"></p>
<p>　文章は系列データであり，文章に含まれる各単語は直前の単語の並びに依存している．そこで，1990年のエルマンネット[2]以来，RNNを用いた文章の分析が試みられてきた—近頃「RNNは深層学習の一種」というような言辞を見かけるが，RNN<span>$\in$</span><!-- Has MathJax -->深層学習では<strong>ない</strong>．<br>　RNNLMと既存手法との相違点は，単語を潜在空間に写像して単語の意味を獲得しようとしているところだ．<br>　上図において隠れ層のベクトルは単語の潜在ベクトルとその履歴より<span>$\begin{split}s(t) =&amp; f(Uw(t) + Ws(t-1))\end{split}$</span><!-- Has MathJax -->となる．次の単語の確率は<span>$\begin{split}y(t) =&amp; g(Vs(t))\end{split}$</span><!-- Has MathJax -->となる．<br>　ここで活性化関数<span>$f(z)$</span><!-- Has MathJax -->は標準シグモイド関数で，<span>$g(z)$</span><!-- Has MathJax -->はソフトマックス関数<span>$\dfrac {e^{zm}} {\Sigma _{k}e^{zm}}$</span><!-- Has MathJax -->である．<br>　学習では確率的勾配降下法を用いて重み<span>$U$</span><!-- Has MathJax -->, <span>$W$</span><!-- Has MathJax -->, <span>$V$</span><!-- Has MathJax -->を更新していくが，このときRNNLMは各層を時間方向に展開し，最後の時刻<span>$t$</span><!-- Has MathJax -->から誤差逆伝播計算をおこなう（BPTT, Backpropagation through time法）．<br>　ここにおいてRNNは多層の順伝播型ニューラルネットのようにみなせる．</p>
<p><img src="/image/rnnlm/bptt.png" width="30%" height="30%"></p>
<p>　BPTT法において，ある時刻<span>$t$</span><!-- Has MathJax -->における出力層の誤差は正解ベクトル<span>$d(t)$</span><!-- Has MathJax -->から出力<span>$y(t)$</span><!-- Has MathJax -->を引いた出力誤差<span>$e_{o}(t)$</span><!-- Has MathJax -->と，時刻<span>$t+1$</span><!-- Has MathJax -->から伝播してきた誤差の和となる．ここでたとえば<span>$V(t+1) = V(t) + s(t)e_{o}(t)^t\alpha - V(t)\beta$</span><!-- Has MathJax -->．<span>$\alpha$</span><!-- Has MathJax -->は学習率であり，各層で行列の勾配に掛かる．<span>$\beta$</span><!-- Has MathJax -->はL2正則化の係数．<br>　このBPTT法で長い系列を扱うとき勾配が消失してしまう問題[3]があり，解決策としてLSTM（Long Short-Term Memory, 長・短期記憶）[4]が提案されているが，割愛する．<br>　なお今回のパラメータは次の通り．</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">last probability of validation data: -441.610349&#10;number of finished iterations: 14&#10;current position in training data: 0&#10;current probability of training data: -441.576456&#10;save after processing # words: 0&#10;# of training words: 6272&#10;input layer size: 1295&#10;hidden layer size: 200&#10;compression layer size: 0&#10;output layer size: 1096&#10;direct connections: 0&#10;direct order: 3&#10;bptt: 6&#10;bptt block: 10&#10;vocabulary size: 1095&#10;class size: 1&#10;old classes: 0&#10;independent sentences mode: 1&#10;starting learning rate: 0.100000&#10;current learning rate: 0.000195&#10;learning rate decrease: 1</span><br></pre></td></tr></table></figure>
<h1 id="おわりに">おわりに</h1><p>　恥知らずのクソ野郎なので何番煎じともわからない記事を書いてしまった．元ネタは<a href="http://www.phontron.com/nlp-title/" target="_blank" rel="external">NLP論文ネタ一覧</a>．<br>　このほか青空文庫やなろう小説[5]をRNNに学習させてはいるが，LSTM込みでもいまだ人間が見て自然に思える文章の生成は難しく思える．<br>　いずれは論文タイトルばかりか論文の内容も自動生成して知の欺瞞をもう一発カマしたいのだが．SFC自体が知の欺瞞っぽいところはさておき．<br>　物語の自動生成なら円城塔がなんとかしてくれるだろう．</p>
<h1 id="参考文献">参考文献</h1><ul>
<li>[1] “RNNLM Toolkit,” <a href="http://rnnlm.org/" target="_blank" rel="external">http://rnnlm.org/</a><ul>
<li>記事中の画像は開発者による<a href="http://www.fit.vutbr.cz/~imikolov/rnnlm/google.pdf" target="_blank" rel="external">紹介スライド</a>より．</li>
<li>解説は<a href="http://kiyukuta.github.io/2013/12/09/mlac2013_day9_recurrent_neural_network_language_model.html" target="_blank" rel="external">これもある意味Deep Learning，Recurrent Neural Network Language Modelの話 [MLAC2013_9日目] — KiyuHu</a>がわかりやすい．</li>
</ul>
</li>
<li>[2] Jeffrey L. Elman, “<a href="http://crl.ucsd.edu/~elman/Papers/fsit.pdf" target="_blank" rel="external">Finding Structure in Time[PDF]</a>,” Cognitive Science, vol. 14, issue. 2, pp. 179-211, 1990.</li>
<li>[3] Sepp Hochreiter, “<a href="http://www.bioinf.jku.at/publications/older/3804.pdf" target="_blank" rel="external">Untersuchungen zu dynamischen neuronalen Netzen[PDF]</a>,” Diploma thesis, TU Munich, 1991.<ul>
<li>読めない．</li>
</ul>
</li>
<li>[4] Sepp Hochreiter and Jürgen Schmidhuber, “<a href="http://deeplearning.cs.cmu.edu/pdfs/Hochreiter97_lstm.pdf" target="_blank" rel="external">Long Short-Term Memory[PDF]</a>,” Neural Computation, vol. 9, no. 8, pp. 1735-1780, 1997.<ul>
<li>解説は<a href="http://qiita.com/t_Signull/items/21b82be280b46f467d1b" target="_blank" rel="external">MachineLearning - わかるLSTM ～ 最近の動向と共に - Qiita</a>がわかりやすい．</li>
</ul>
</li>
<li>[5] <a href="http://ncode.syosetu.com/n9073ca/" target="_blank" rel="external">幻想再帰のアリュージョニスト</a>，おすすめです．</li>
</ul>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://ntddk.github.io/2015/12/19/generating-thesis-titles-with-rnnlm/" data-id="cilidqj09001fegos9ixg34hc" class="article-share-link">Share</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/neural-network/">neural network</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/nlp/">nlp</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/rnn/">rnn</a></li></ul>

    </footer>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/01/08/controlling-rolling-spider-with-leap-motion-cylon-js/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          凧揚げ
        
      </div>
    </a>
  
  
    <a href="/2015/12/11/autoprobe/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">マルウェアの動的解析に基づくC&amp;Cサーバの探索</div>
    </a>
  
</nav>

  
</article>

</section>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2016 ntddk<br>
      <a href="https://github.com/ntddk/hexo-theme-jathena" target="_blank">JAthena</a> by <a href="http://ntddk.github.io" target="_blank">ntddk</a> | Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>
    </div>
  </div>
</footer>
    </div>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css" type="text/css">
  <script src="/fancybox/jquery.fancybox.pack.js" type="text/javascript"></script>


<script src="/js/script.js" type="text/javascript"></script>
  </div>
<!-- mathjax config similar to math.stackexchange -->

<script type="text/x-mathjax-config">
  MathJax.Hub.Config({
    tex2jax: {
      inlineMath: [ ['$','$'], ["\\(","\\)"] ],
      processEscapes: true
    }
  });
</script>

<script type="text/x-mathjax-config">
    MathJax.Hub.Config({
      tex2jax: {
        skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
      }
    });
</script>

<script type="text/x-mathjax-config">
    MathJax.Hub.Queue(function() {
        var all = MathJax.Hub.getAllJax(), i;
        for(i=0; i < all.length; i += 1) {
            all[i].SourceElement().parentNode.className += ' has-jax';
        }
    });
</script>

<script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>
</body>
</html>